product = ["Капкейк", "Мороженое", "Эклер", "Коктейль", "Горячий шоколад"]
flavor = ["Клубника", "Мята", "Шоколад", "Ваниль", "Малина", "Банан", "Сгущёнка"]
topping = ["Вишенка", "Карамель", "Мармеладки", "Взбитые сливки", "Кусочки шоколада"]
print("_________________")
print("🐱Еда и напитки🐱")
print("_________________")
i = 1
for p in product:
    print(i, p)
    i += 1
print("_________")
print("🐱Вкусы🐱")
print("_________")
i = 1
for f in flavor:
    print(i, f)
    i += 1
print("______________________")
print("🐱Добавки и топпинги🐱")
print("______________________")
i = 1
for t in topping:
    print(i, t)
    i += 1
