products = ["Капкейк", "Мороженое", "Эклер", "Коктейль", "Горячий шоколад"]
flavors = ["Клубника", "Мята", "Шоколад", "Ваниль", "Малина", "Банан", "Сгущёнка"]
toppings = ["Вишенка", "Карамель", "Мармеладки", "Взбитые сливки", "Кусочки шоколада"]
print("_________________")
print("🐱Еда и напитки🐱")
print("_________________")
i = 1
for p in products:
    print(i, p)
    i += 1
product = input("🐱Введите номер еды/напитка: ")
print("_________")
print("🐱Вкусы🐱")
print("_________")
i = 1
for f in flavors:
    print(i, f)
    i += 1
flavor = input("🐱Введите номер вкуса: ")
print("______________________")
print("🐱Добавки и топпинги🐱")
print("______________________")
i = 1
for t in toppings:
    print(i, t)
    i += 1
topping = input("🐱Введите номер топпинга: ")
