products = ["Капкейк", "Мороженое", "Эклер", "Коктейль", "Горячий шоколад"]
flavors = ["Клубника", "Мята", "Шоколад", "Ваниль", "Малина", "Карамель", "Банан", "Сгущёнка"]
toppings = ["Вишенка", "Карамельная поливка", "Мармеладки", "Взбитые сливки", "Кусочки шоколада", "Зефирки"]
print("🐱Добро пожаловать в кафе Meow-Meow!🍨🍦🍧")
name = input("🐱Напишите ваше имя: ")
print("_________________")
print("🐱Еда и напитки🐱")
print("_________________")
i = 1
for p in products:
    print(i, p)
    i += 1
product = int(input("🐱Введите номер еды/напитка: "))
print("_________")
print("🐱Вкусы🐱")
print("_________")
i = 1
for f in flavors:
    print(i, f)
    i += 1
flavor = int(input("🐱Введите номер вкуса: "))
print("______________________")
print("🐱Добавки и топпинги🐱")
print("______________________")
i = 1
for t in toppings:
    print(i, t)
    i += 1
topping = int(input("🐱Введите номер топпинга: "))
print("🐱Ваш заказ,", name, ":")
print("🐱Еда/напиток:", products[product - 1])
print("🐱Вкус:", flavors[flavor - 1])
print("🐱Топпинг:", toppings[topping - 1])
print("Спасибо за заказ!")
